---
kind: enumMember
id: F:Autodesk.Revit.DB.PartEdgeConditionOrientation.Complement
enum: Autodesk.Revit.DB.PartEdgeConditionOrientation
source: html/da54576e-5aa4-7886-4bcf-0ad11b3c6a49.htm
---
# Autodesk.Revit.DB.PartEdgeConditionOrientation.Complement

Before division gap is applied the left/upper and right/lower profiles coincide
 and neighboring panels complement each other precisely.